import indicator
import pandas as pd


def dpo_strategy(ohlcv: pd.DataFrame, n=20):
    dpo_value = indicator.DPO(ohlcv, n=n)
    direct = 'buy' if dpo_value > 0 else 'sell'
    return direct


def maamt_strategy(ohlcv: pd.DataFrame, n=40):
    maamt, volume = indicator.MAAMT(ohlcv, n=n)
    direct = 'buy' if volume > maamt else 'sell'
    return direct


def tii_strategy(ohlcv: pd.DataFrame, n1=40, n2=9):
    tii, tii_signal = indicator.TII(ohlcv, n1=n1, n2=n2)
    direct = 'buy' if tii > tii_signal else 'sell'
    return direct


def er_strategy(ohlcv: pd.DataFrame, n=20):
    direct = ''
    back_day = -1
    bull_power, bear_power = indicator.ER(ohlcv, n=n)
    if bear_power > 0:
        direct = 'buy'
    if bull_power < 0:
        direct = 'sell'
    while direct == '':
        bull_power, bear_power = indicator.ER(ohlcv[:back_day], n=n)
        if bear_power > 0:
            direct = 'buy'
        if bull_power < 0:
            direct = 'sell'
        back_day = back_day - 1
    return direct


def ma_strategy(ohlcv: pd.DataFrame, slow=20, fast=5):
    ma1 = indicator.ma(ohlcv=ohlcv, n=slow)
    ma2 = indicator.ma(ohlcv=ohlcv, n=fast)
    direct = 'buy' if ma2 > ma1 else 'sell'
    return direct


def ma_cross_strategy(ohlcv: pd.DataFrame, n=5):
    ma = indicator.ma(ohlcv=ohlcv, n=n)
    close = ohlcv['close'].tolist()[-1]
    direct = 'buy' if close > ma else 'sell'
    return direct


def strategy_combine(etf_data: pd.DataFrame):
    tii = tii_strategy(etf_data)
    er = er_strategy(etf_data)
    maamt = maamt_strategy(etf_data)
    dpo = dpo_strategy(etf_data)
    ma = ma_cross_strategy(etf_data, n=20)
    # return [tii, maamt, dpo]
    # 1.6
    # return [tii, er, maamt, dpo]  #胜率: 0.3739130434782609 败率: 0.6260869565217392 盈亏比: 2.2802850351731516
    # 1.5
    # return [er, maamt, dpo] # 胜率: 0.371900826446281 败率: 0.628099173553719 盈亏比: 2.1608333617392135
    # 1.81742
    # return [tii, maamt, dpo]  # 胜率: 0.3816793893129771 败率: 0.6183206106870229 盈亏比: 2.3604458652855973
    # .53
    return [tii, er, dpo] # 胜率: 0.3235294117647059 败率: 0.6764705882352942 盈亏比: 2.0789329373182297
    # 1.67
    # return [tii, er, maamt]  # 胜率: 0.3793103448275862 败率: 0.6206896551724138 盈亏比: 2.1514593076326016
    # 1.34
    # return [dpo] # 胜率: 0.3291139240506329 败率: 0.6708860759493671 盈亏比: 1.9961507815587536
    # 1.0
    # return [er] #  胜率: 0.2894736842105263 败率: 0.7105263157894737 盈亏比: 1.622503803423686
    # 1.66
    # return [maamt]  # 胜率: 0.45098039215686275 败率: 0.5490196078431373 盈亏比: 1.594721787384113
    # 1.5
    # return [tii]  # 胜率: 0.4714285714285714 败率: 0.5285714285714286 盈亏比: 1.7657201588535132
    # 1.56
    # return [dpo, maamt] # 胜率: 0.391304347826087 败率: 0.6086956521739131 盈亏比: 2.1270387285995613
    # 1.26
    # return [dpo, er] # 胜率: 0.3108108108108108 败率: 0.6891891891891891 盈亏比: 1.909201015635396
    # 1.75
    # return [dpo, tii]  # 胜率: 0.3108108108108108 败率: 0.6891891891891891 盈亏比: 2.2012029435186897
    # 1.8319
    # return [tii, maamt]  # 胜率: 0.4268292682926829 败率: 0.573170731707317 盈亏比: 1.8585261302548868
    # 1.59
    # return [tii, er]  # 胜率: 0.30303030303030304 败率: 0.696969696969697 盈亏比: 1.9713099171089428


# 年化收益率: OrderedDict([(2011, 0.0), (2012, -0.059182187190000124), (2013, 0.21184097379568878), (2014, 0.1917914917428023), (2015, 0.8007249383493), (2016, -0.1507829522782037), (2017, -0.01127350180272646), (2018, -0.10268130902155193), (2019, 0.33992611896744496), (2020, 0.17938762923141116), (2021, 0.1827567250195965)])
# 夏普: 0.5257240252754136
# 最大回撤:29.56，最大回撤周期1004
# 总收益率:1.24
# 交易次数: 112
# 胜率: 0.4107142857142857 败率: 0.5892857142857143 盈亏比: 3.525653102685943


"""
bencnmark
 [tii, er, dpo]
data_value 337540.6945939992
年化收益率: OrderedDict([(2011, -0.03259063679999996), (2012, -0.05736073506301986), (2013, 0.4242543360198434), (2014, 0.1805434292450221), (2015, 0.8888965494546432), (2016, -0.22161798525891496), (2017, -0.03513301816970049), (2018, -0.1852474035250653), (2019, 0.3429589794364991), (2020, 0.1876320260534321), (2021, 0.19415856235839346)])
夏普: 0.46979694526194005
最大回撤:41.58，最大回撤周期1126
总收益率:1.22
交易次数: 66
胜率: 0.3181818181818182 败率: 0.6818181818181818
盈亏比: 4.459888271739034
"""

"""
[dpo, tii] 
data_value 346609.0651409992
<class 'collections.OrderedDict'>
年化收益率: OrderedDict([(2011, -0.03682242538999958), (2012, -0.009475614404431454), (2013, 0.37500364080033943), (2014, 0.21946327298424761), (2015, 0.6802093537357952), (2016, -0.170646817961836), (2017, -0.019636973399535185), (2018, -0.16920208033817352), (2019, 0.3670210310841495), (2020, 0.1723443587440352), (2021, 0.19118763815772066)])
夏普: 0.5448149959866955
最大回撤:35.36，最大回撤周期1037
总收益率:1.24
交易次数: 72
胜率: 0.3055555555555556 败率: 0.6944444444444444
盈亏比: 5.129342646715678

"""

"""
[tii, maamt] 
data_value 112983.87116300022
<class 'collections.OrderedDict'>
年化收益率: OrderedDict([(2018, -0.17698104109000035), (2019, 0.233559339756376), (2020, 0.11874665119220307), (2021, -0.005248009036683876)])
夏普: 0.2135348828969679
最大回撤:22.54，最大回撤周期349
总收益率:0.12
交易次数: 68
胜率: 0.4264705882352941 败率: 0.5735294117647058
盈亏比: 1.6523947831207617


"""

""" 4
data_value 267383.799941999
<class 'collections.OrderedDict'>
年化收益率: OrderedDict([(2014, 0.06699812079000034), (2015, 0.9597424777203936), (2016, -0.1965941153666766), (2017, -0.0216535804524135), (2018, -0.13969467361619736), (2019, 0.33792940676124994), (2020, 0.18905737545844148), (2021, 0.18865587098530168)])
夏普: 0.4781868739064482
最大回撤:36.54，最大回撤周期1032
总收益率:0.98
交易次数: 74
胜率: 0.3918918918918919 败率: 0.6081081081081081
盈亏比: 3.561029191964756
"""

"""
[tii, maamt, dpo] 
data_value 270012.982090999
<class 'collections.OrderedDict'>
年化收益率: OrderedDict([(2014, 0.08266176342000064), (2015, 0.7914605183739032), (2016, -0.15164158705897413), (2017, -0.01141750358844984), (2018, -0.11402941876042916), (2019, 0.34230361659385755), (2020, 0.1789648126629375), (2021, 0.18391742446910797)])
夏普: 0.5399707129564801
最大回撤:29.88，最大回撤周期1006
总收益率:0.99
交易次数: 89
胜率: 0.4044943820224719 败率: 0.5955056179775281
盈亏比: 3.5614917124812306
"""

"""
data_value 334438.3780409798
年化收益率: OrderedDict([(2017, 0.1550783509543998), (2018, 0.024191118300080694), (2019, 0.42323039136765805), (2020, 0.6687473773004227), (2021, 0.1903038925839622)])
夏普: 1.2380818730259118
最大回撤:18.50，最大回撤周期220
总收益率:1.21
交易次数: 33
胜率: 0.42424242424242425 败率: 0.5454545454545454
盈亏比: 6.76328714148919

"""